MaksymShutiak/microcontrollers/STM32Nucleo_l4r5zi/headers/rcc.h
struct rcc {
  volatile uint32_t CR;
  volatile uint32_t ICSCR;
  volatile uint32_t CFGR;
  volatile uint32_t PLLCFGR; 
  volatile uint32_t PLLSAI1CFGR; 
  volatile uint32_t PLLSAI2CFGR; 
  volatile uint32_t CIER; 
  volatile uint32_t CIFR;
  volatile uint32_t CICR;
  volatile uint32_t RESERVE0;
  volatile uint32_t AHB1RSTR;
  volatile uint32_t AHB2RSTR;
  volatile uint32_t AHB3RSTR;
  volatile uint32_t RESERVE1;
  volatile uint32_t APB1RSTR1;
  volatile uint32_t APB1RSTR2;
  volatile uint32_t APB2RSTR;
  volatile uint32_t RESERVE2;
  volatile uint32_t AHB1ENR; 
  volatile uint32_t AHB2ENR;
  volatile uint32_t AHB3ENR;
  volatile uint32_t RESERVE3;
  volatile uint32_t APB1ENR1;
  volatile uint32_t APB1ENR2;
  volatile uint32_t APB2ENR;
  volatile uint32_t RESERVE4;
  volatile uint32_t AHB1SMENR;
  volatile uint32_t AHB2SMENR;
  volatile uint32_t AHB3SMENR;
  volatile uint32_t RESERVE5;
  volatile uint32_t APB1SMENR1;
  volatile uint32_t APB1SMENR2;
  volatile uint32_t APB2SMENR;
  volatile uint32_t RESERVE6;
  volatile uint32_t CCIPR;
  volatile uint32_t BDCR;
  volatile uint32_t CSR;
  volatile uint32_t CRRCR;
  volatile uint32_t CCIPR2;
  volatile uint32_t RESERVE7;
  volatile uint32_t DLYCFGR;
};
